{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "AutoPrefixTool",
			"Children": [
				{
					"Source": {
						"Text": "  操作"
					},
					"Translation": {
						"Text": "  操作"
					},
					"Key": "ColOp"
				},
				{
					"Source": {
						"Text": "+ 添加规则"
					},
					"Translation": {
						"Text": "+ ルールを追加"
					},
					"Key": "AddRuleBtn"
				},
				{
					"Source": {
						"Text": "丢弃当前修改，从 JSON 重新读取全部配置"
					},
					"Translation": {
						"Text": "現在の変更を破棄し、JSONから全設定を再読込"
					},
					"Key": "ReloadBtnTip"
				},
				{
					"Source": {
						"Text": "从 JSON 中删除这套前缀"
					},
					"Translation": {
						"Text": "このプレフィックスセットをJSONから削除"
					},
					"Key": "DeleteSetBtnTip"
				},
				{
					"Source": {
						"Text": "从项目设置读取"
					},
					"Translation": {
						"Text": "プロジェクト設定から読込"
					},
					"Key": "PullBtn"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 在下方规则表里选择 目标类 及其 前缀\n  2. 填好表后可点击 保存配置 保存当前配置\n  3. 点 应用到项目设置 把当前这套写进 DefaultGame.ini 并生效\n  4. 之后新建蓝图/资产时，重命名输入框的默认值就会变成对应前缀\n  5. 改乱了可点 重置默认值 ，把当前配置恢复为默认前缀（需再点 应用到项目设置 才生效）\n  6. 本插件只接管蓝图/资产的前缀；C++ 类保持引擎原生"
					},
					"Translation": {
						"Text": "使い方:\n  1. 下のルール表で対象クラスとそのプレフィックスを選択\n  2. 表を埋めたら「設定を保存」をクリックして現在の設定を保存\n  3. 「プロジェクト設定に適用」でこのセットをDefaultGame.iniに書き込み有効化\n  4. 以降新規作成するブループリント／アセットのリネーム欄の初期値が対応プレフィックスに\n  5. 乱した場合は「デフォルトに戻す」で現在の設定を既定プレフィックスに復元（再度「プロジェクト設定に適用」が必要）\n  6. 本プラグインはブループリント／アセットのプレフィックスのみ管理。C++クラスはエンジン標準のまま"
					},
					"Key": "AutoPrefixHelp"
				},
				{
					"Source": {
						"Text": "保存配置"
					},
					"Translation": {
						"Text": "設定を保存"
					},
					"Key": "SaveSetBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "削除"
					},
					"Key": "DeleteSetBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "削除"
					},
					"Key": "RemoveRuleBtn"
				},
				{
					"Source": {
						"Text": "删除这条规则"
					},
					"Translation": {
						"Text": "このルールを削除"
					},
					"Key": "RemoveRuleBtnTip"
				},
				{
					"Source": {
						"Text": "前缀"
					},
					"Translation": {
						"Text": "プレフィックス"
					},
					"Key": "ColPrefix"
				},
				{
					"Source": {
						"Text": "前缀配置: "
					},
					"Translation": {
						"Text": "プレフィックス設定: "
					},
					"Key": "SetLabel"
				},
				{
					"Source": {
						"Text": "如 BP_"
					},
					"Translation": {
						"Text": "例: BP_"
					},
					"Key": "PrefixHint"
				},
				{
					"Source": {
						"Text": "应用到项目设置"
					},
					"Translation": {
						"Text": "プロジェクト設定に適用"
					},
					"Key": "ApplyBtn"
				},
				{
					"Source": {
						"Text": "打开配置文件夹"
					},
					"Translation": {
						"Text": "設定フォルダを開く"
					},
					"Key": "OpenFolderBtn"
				},
				{
					"Source": {
						"Text": "把当前配置写入 DefaultGame.ini，更新 项目设置 -> 插件 -> AutoPrefix "
					},
					"Translation": {
						"Text": "現在の設定をDefaultGame.iniに書き込み、プロジェクト設定→プラグイン→AutoPrefixを更新"
					},
					"Key": "ApplyBtnTip"
				},
				{
					"Source": {
						"Text": "把当前配置的规则恢复为内置默认（常见 UE 命名约定），仅在内存中生效，点 保存配置 可持久化"
					},
					"Translation": {
						"Text": "現在の設定のルールを内蔵デフォルト（UE一般的命名規則）に戻します。メモリ内のみ有効、保存設定で永続化"
					},
					"Key": "ResetBtnTip"
				},
				{
					"Source": {
						"Text": "把当前配置追加保存到 JSON，同名则覆盖该配置"
					},
					"Translation": {
						"Text": "現在の設定をJSONに追記保存します。同名なら上書き"
					},
					"Key": "SaveSetBtnTip"
				},
				{
					"Source": {
						"Text": "把项目设置里现有的配置反向读回面板"
					},
					"Translation": {
						"Text": "プロジェクト設定の既存設定をパネルに逆読込"
					},
					"Key": "PullBtnTip"
				},
				{
					"Source": {
						"Text": "新建空配置"
					},
					"Translation": {
						"Text": "新規空設定"
					},
					"Key": "NewSetBtn"
				},
				{
					"Source": {
						"Text": "清空当前规则表，从零开始配置一套新的前缀"
					},
					"Translation": {
						"Text": "現在のルール表をクリアし、ゼロから新しいプレフィックスを設定"
					},
					"Key": "NewSetBtnTip"
				},
				{
					"Source": {
						"Text": "目标类（蓝图填父类 / 资产填资产类型）"
					},
					"Translation": {
						"Text": "対象クラス（ブループリントは親クラス／アセットはアセット種別）"
					},
					"Key": "ColClass"
				},
				{
					"Source": {
						"Text": "这套前缀保存时使用的名字"
					},
					"Translation": {
						"Text": "このプレフィックスセット保存時に使う名前"
					},
					"Key": "SetNameHint"
				},
				{
					"Source": {
						"Text": "配置名称: "
					},
					"Translation": {
						"Text": "設定名: "
					},
					"Key": "SetNameLabel"
				},
				{
					"Source": {
						"Text": "重新加载"
					},
					"Translation": {
						"Text": "再読み込み"
					},
					"Key": "ReloadBtn"
				},
				{
					"Source": {
						"Text": "重置默认值"
					},
					"Translation": {
						"Text": "デフォルトに戻す"
					},
					"Key": "ResetBtn"
				}
			]
		},
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source": {
						"Text": "SuBaseToolsBox_PluginCommand"
					},
					"Translation": {
						"Text": "SuBaseToolsBox_PluginCommand"
					},
					"Key": "SuBaseToolsBox_PluginCommand"
				}
			]
		},
		{
			"Namespace": "FToolsBoxModule",
			"Children": [
				{
					"Source": {
						"Text": "工具箱"
					},
					"Translation": {
						"Text": "ツールボックス"
					},
					"Key": "ToolsBox"
				},
				{
					"Source": {
						"Text": "物理摆放生成"
					},
					"Translation": {
						"Text": "物理配置生成"
					},
					"Key": "PhysicsPlacerSpawnMode"
				},
				{
					"Source": {
						"Text": "详情"
					},
					"Translation": {
						"Text": "詳細"
					},
					"Key": "ToolBoxAuthor"
				}
			]
		},
		{
			"Namespace": "Info",
			"Children": [
				{
					"Source": {
						"Text": "关于"
					},
					"Translation": {
						"Text": "について"
					},
					"Key": "DetailsTitle"
				}
			]
		},
		{
			"Namespace": "MaterialTransferTool",
			"Children": [
				{
					"Source": {
						"Text": "丢弃当前修改，从 JSON 重新读取全部配置"
					},
					"Translation": {
						"Text": "現在の変更を破棄し、JSONから全設定を再読込"
					},
					"Key": "ReloadBtnTip"
				},
				{
					"Source": {
						"Text": "两者都不勾选：按源材质类型生成（实例→实例，材质类→材质类）。"
					},
					"Translation": {
						"Text": "どちらも未チェックの場合：ソースマテリアル種別で生成（インスタンス→インスタンス、マテリアルクラス→マテリアルクラス）。"
					},
					"Key": "CkeckTip"
				},
				{
					"Source": {
						"Text": "从 JSON 中删除这套配置"
					},
					"Translation": {
						"Text": "この設定をJSONから削除"
					},
					"Key": "DeleteConfigBtnTip"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 选择需要继承自的母材质或材质实例类\n  2. 内容浏览器中选择一个或多个需要被转移参数值的材质实例或材质类\n  3. 配置可在下拉框保存多套、随时切换；点 开始转移参数 后生成新材质并赋值参数\n"
					},
					"Translation": {
						"Text": "使い方:\n  1. 継承元となる親マテリアルまたはマテリアルインスタンスクラスを選択\n  2. コンテンツブラウザで、パラメータ値を転送するマテリアルインスタンスまたはマテリアルクラスを1つ以上選択\n  3. 設定はドロップダウンに複数セット保存・いつでも切替可能。「パラメータ転送を開始」で新マテリアル生成とパラメータ割当\n"
					},
					"Key": "MaterialAttributeTransferHelper"
				},
				{
					"Source": {
						"Text": "例如 /Game/Materials/Generated"
					},
					"Translation": {
						"Text": "例: /Game/Materials/Generated"
					},
					"Key": "PathHint"
				},
				{
					"Source": {
						"Text": "保存到各自文件夹中"
					},
					"Translation": {
						"Text": "それぞれのフォルダに保存"
					},
					"Key": "SaveToFolderTip"
				},
				{
					"Source": {
						"Text": "保存配置"
					},
					"Translation": {
						"Text": "設定を保存"
					},
					"Key": "SaveConfigBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "削除"
					},
					"Key": "DeleteConfigBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "削除"
					},
					"Key": "RowDelBtn"
				},
				{
					"Source": {
						"Text": "删除这一行映射"
					},
					"Translation": {
						"Text": "このマッピング行を削除"
					},
					"Key": "RowDelTip"
				},
				{
					"Source": {
						"Text": "开始转移参数"
					},
					"Translation": {
						"Text": "パラメータ転送を開始"
					},
					"Key": "RunBtn"
				},
				{
					"Source": {
						"Text": "打开配置"
					},
					"Translation": {
						"Text": "設定を開く"
					},
					"Key": "OpenFolderBtn"
				},
				{
					"Source": {
						"Text": "打开配置文件夹"
					},
					"Translation": {
						"Text": "設定フォルダを開く"
					},
					"Key": "OpenFolderBtnTip"
				},
				{
					"Source": {
						"Text": "执行日志:"
					},
					"Translation": {
						"Text": "実行ログ:"
					},
					"Key": "LogTitle"
				},
				{
					"Source": {
						"Text": "把当前配置追加保存到 JSON，同名则覆盖该配置"
					},
					"Translation": {
						"Text": "現在の設定をJSONに追記保存します。同名なら上書き"
					},
					"Key": "SaveConfigBtnTip"
				},
				{
					"Source": {
						"Text": "新建空配置"
					},
					"Translation": {
						"Text": "新規空設定"
					},
					"Key": "NewConfigBtn"
				},
				{
					"Source": {
						"Text": "母材质参数名 (新)"
					},
					"Translation": {
						"Text": "親マテリアルパラメータ名 (新)"
					},
					"Key": "TitleL"
				},
				{
					"Source": {
						"Text": "添加参数行"
					},
					"Translation": {
						"Text": "パラメータ行を追加"
					},
					"Key": "AddBtn"
				},
				{
					"Source": {
						"Text": "清空参数行"
					},
					"Translation": {
						"Text": "パラメータ行をクリア"
					},
					"Key": "ClearBtn"
				},
				{
					"Source": {
						"Text": "清空当前配置，从零开始配置一套新的转移方案"
					},
					"Translation": {
						"Text": "現在の設定をクリアし、ゼロから新しい転送方案を設定"
					},
					"Key": "NewConfigBtnTip"
				},
				{
					"Source": {
						"Text": "源材质变量名 (旧)"
					},
					"Translation": {
						"Text": "ソースマテリアル変数名 (旧)"
					},
					"Key": "TitleR"
				},
				{
					"Source": {
						"Text": "生成保存路径: "
					},
					"Translation": {
						"Text": "生成保存パス: "
					},
					"Key": "PathLabel"
				},
				{
					"Source": {
						"Text": "目标母材质: "
					},
					"Translation": {
						"Text": "対象親マテリアル: "
					},
					"Key": "TargetLabel"
				},
				{
					"Source": {
						"Text": "移除所有映射行"
					},
					"Translation": {
						"Text": "全マッピング行を削除"
					},
					"Key": "ClearBtnTip"
				},
				{
					"Source": {
						"Text": "获取当前路径"
					},
					"Translation": {
						"Text": "現在のパスを取得"
					},
					"Key": "GetPathBtn"
				},
				{
					"Source": {
						"Text": "转换后统一生成材质实例"
					},
					"Translation": {
						"Text": "変換後に統一してマテリアルインスタンスを生成"
					},
					"Key": "GenInstChk"
				},
				{
					"Source": {
						"Text": "转换后统一生成材质类"
					},
					"Translation": {
						"Text": "変換後に統一してマテリアルクラスを生成"
					},
					"Key": "GenMatChk"
				},
				{
					"Source": {
						"Text": "这套配置保存时使用的名字"
					},
					"Translation": {
						"Text": "この設定保存時に使う名前"
					},
					"Key": "ConfigNameHint"
				},
				{
					"Source": {
						"Text": "配置: "
					},
					"Translation": {
						"Text": "設定: "
					},
					"Key": "ConfigLabel"
				},
				{
					"Source": {
						"Text": "配置名称: "
					},
					"Translation": {
						"Text": "設定名: "
					},
					"Key": "ConfigNameLabel"
				},
				{
					"Source": {
						"Text": "重新加载"
					},
					"Translation": {
						"Text": "再読み込み"
					},
					"Key": "ReloadBtn"
				}
			]
		},
		{
			"Namespace": "PhysicsPlacerTool",
			"Children": [
				{
					"Source": {
						"Text": "+ 添加网格"
					},
					"Translation": {
						"Text": "+ メッシュを追加"
					},
					"Key": "AddMeshBtn"
				},
				{
					"Source": {
						"Text": "X"
					},
					"Translation": {
						"Text": "X"
					},
					"Key": "OffX"
				},
				{
					"Source": {
						"Text": "Y"
					},
					"Translation": {
						"Text": "Y"
					},
					"Key": "OffY"
				},
				{
					"Source": {
						"Text": "Z"
					},
					"Translation": {
						"Text": "Z"
					},
					"Key": "OffZ"
				},
				{
					"Source": {
						"Text": "不勾选则按列表顺序生成"
					},
					"Translation": {
						"Text": "未チェック時はリスト順に生成"
					},
					"Key": "RandomSpawnTip"
				},
				{
					"Source": {
						"Text": "从生成列表移除该网格"
					},
					"Translation": {
						"Text": "生成リストからこのメッシュを削除"
					},
					"Key": "RemoveSpawnTip"
				},
				{
					"Source": {
						"Text": "位置回溯"
					},
					"Translation": {
						"Text": "位置ロールバック"
					},
					"Key": "RestoreBtn"
				},
				{
					"Source": {
						"Text": "位置回溯（摆位存档）"
					},
					"Translation": {
						"Text": "位置ロールバック（ポーズ保存）"
					},
					"Key": "PoseTitle"
				},
				{
					"Source": {
						"Text": "保存当前位置"
					},
					"Translation": {
						"Text": "現在位置を保存"
					},
					"Key": "SavePoseBtn"
				},
				{
					"Source": {
						"Text": "保存时使用的名字，可自定义"
					},
					"Translation": {
						"Text": "保存時に使う名前、カスタマイズ可"
					},
					"Key": "PoseNameHint"
				},
				{
					"Source": {
						"Text": "停下物理模拟，物体保留在当前（掉落到的）位置"
					},
					"Translation": {
						"Text": "物理シミュレーションを停止。オブジェクトは現在（落下先）位置に残る"
					},
					"Key": "StopBtnTip"
				},
				{
					"Source": {
						"Text": "停止模拟"
					},
					"Translation": {
						"Text": "シミュレーション停止"
					},
					"Key": "StopBtn"
				},
				{
					"Source": {
						"Text": "光标检测地面，点击生成物理物体"
					},
					"Translation": {
						"Text": "カーソルが地面を検出、クリックで物理オブジェクトを生成"
					},
					"Key": "SpawnTip"
				},
				{
					"Source": {
						"Text": "删除存档"
					},
					"Translation": {
						"Text": "アーカイブを削除"
					},
					"Key": "DeletePoseBtn"
				},
				{
					"Source": {
						"Text": "可从内容浏览器中拖入添加"
					},
					"Translation": {
						"Text": "コンテンツブラウザからドラッグ＆ドロップで追加可能"
					},
					"Key": "DropHint"
				},
				{
					"Source": {
						"Text": "可多选，勾选框控制是否生成；可从内容浏览器拖入网格"
					},
					"Translation": {
						"Text": "複数選択可、チェックボックスで生成可否を制御。コンテンツブラウザからメッシュをドラッグ可能"
					},
					"Key": "MeshListTip"
				},
				{
					"Source": {
						"Text": "启动模拟"
					},
					"Translation": {
						"Text": "シミュレーション開始"
					},
					"Key": "StartBtn"
				},
				{
					"Source": {
						"Text": "基准偏移(米)"
					},
					"Translation": {
						"Text": "基準オフセット(メートル)"
					},
					"Key": "BaseOffTitle"
				},
				{
					"Source": {
						"Text": "存档名称: "
					},
					"Translation": {
						"Text": "アーカイブ名: "
					},
					"Key": "PoseNameLabel"
				},
				{
					"Source": {
						"Text": "打开配置文件夹"
					},
					"Translation": {
						"Text": "設定フォルダを開く"
					},
					"Key": "OpenFolderBtn"
				},
				{
					"Source": {
						"Text": "把列表里物体的 位置/旋转/缩放 记成一份带名字的摆位（同名覆盖，不同名追加）"
					},
					"Translation": {
						"Text": "リスト内オブジェクトの位置／回転／スケールを名前付きポーズとして記録（同名は上書き、異名は追加）"
					},
					"Key": "SavePoseBtnTip"
				},
				{
					"Source": {
						"Text": "把当前视口里选中的 Actor 加入下方列表"
					},
					"Translation": {
						"Text": "ビューポートで選択中のアクターを下のリストに追加"
					},
					"Key": "CaptureBtnTip"
				},
				{
					"Source": {
						"Text": "把选中的那套摆位重新套回当前关卡里标签匹配的物体"
					},
					"Translation": {
						"Text": "選択したポーズを、現在のレベルでタグが一致するオブジェクトに再適用"
					},
					"Key": "RestoreBtnTip"
				},
				{
					"Source": {
						"Text": "模拟速度系数: "
					},
					"Translation": {
						"Text": "シミュレーション速度係数: "
					},
					"Key": "SimSpeedLabel"
				},
				{
					"Source": {
						"Text": "正在模拟..."
					},
					"Translation": {
						"Text": "シミュレーション中..."
					},
					"Key": "SimulatingBtn"
				},
				{
					"Source": {
						"Text": "清空列表"
					},
					"Translation": {
						"Text": "リストをクリア"
					},
					"Key": "ClearBtn"
				},
				{
					"Source": {
						"Text": "物理摆放工具：\n  1. 进入  生成模式  后，在视口里移动光标会从光标向前检测地面，点击即在该处生成物理物体（带偏移，默认上方 2 米掉落）。Alt+点击不生成。\n  2. 生成模式支持多个网格：从内容浏览器把 StaticMesh 拖到  生成网格列表  即可加入\n  3. 或在视口里框选/点选若干物体对象，点 获取编辑器选中 加入下方列表，再 启动模拟 让它们自由掉落；停止模拟 停下并保留当前位置。\n  4. 模拟前/中/后都可  保存当前位置  记成一份带名字的摆位；不理想时用 位置回溯 返回保存时位置。\n  （物体需带网格等 PrimitiveComponent；模拟时物体会被设为可移动并开启重力）"
					},
					"Translation": {
						"Text": "物理配置ツール:\n  1. 生成モードに入ると、ビューポート内でカーソルを動かすと前方の地面を検出。クリックでその場に物理オブジェクトを生成（オフセット付き、既定は上方2mから落下）。Alt+クリックは生成しない。\n  2. 生成モードは複数メッシュ対応：コンテンツブラウザのStaticMeshを生成メッシュリストへドラッグで追加。\n  3. またはビューポートで複数オブジェクトを枠/クリック選択し、「エディタ選択を取得」で下のリストへ追加、その後「シミュレーション開始」で自由落下。「シミュレーション停止」で停止し現在位置を保持。\n  4. シミュレーション前／中／後いつでも「現在位置を保存」で名前付きポーズを記録。不満な場合は「位置ロールバック」で保存時位置へ戻る。\n  （オブジェクトはメッシュ等のPrimitiveComponentが必要。シミュレーション中は可動・重力有効化）"
					},
					"Key": "Help"
				},
				{
					"Source": {
						"Text": "物理摆放模拟"
					},
					"Translation": {
						"Text": "物理配置シミュレーション"
					},
					"Key": "SimRealtimeOverride"
				},
				{
					"Source": {
						"Text": "物理模拟"
					},
					"Translation": {
						"Text": "物理シミュレーション"
					},
					"Key": "SimTitle"
				},
				{
					"Source": {
						"Text": "生成模式"
					},
					"Translation": {
						"Text": "生成モード"
					},
					"Key": "SpawnTitle"
				},
				{
					"Source": {
						"Text": "生成网格列表"
					},
					"Translation": {
						"Text": "生成メッシュリスト"
					},
					"Key": "MeshListTitle"
				},
				{
					"Source": {
						"Text": "生成选项"
					},
					"Translation": {
						"Text": "生成オプション"
					},
					"Key": "SpawnOptTitle"
				},
				{
					"Source": {
						"Text": "移除"
					},
					"Translation": {
						"Text": "削除"
					},
					"Key": "RemoveActorBtn"
				},
				{
					"Source": {
						"Text": "移除"
					},
					"Translation": {
						"Text": "削除"
					},
					"Key": "RemoveSpawnBtn"
				},
				{
					"Source": {
						"Text": "获取编辑器选中"
					},
					"Translation": {
						"Text": "エディタ選択を取得"
					},
					"Key": "CaptureBtn"
				},
				{
					"Source": {
						"Text": "让列表里的物体开启物理、开始自由掉落"
					},
					"Translation": {
						"Text": "リスト内オブジェクトの物理を有効化し、自由落下させる"
					},
					"Key": "StartBtnTip"
				},
				{
					"Source": {
						"Text": "进入后在视口点击地面即生成物理物体；Alt+点击不生成"
					},
					"Translation": {
						"Text": "入室後、ビューポートで地面をクリックすると物理オブジェクトを生成。Alt+クリックは生成しない"
					},
					"Key": "SpawnBtnTip"
				},
				{
					"Source": {
						"Text": "进入生成模式"
					},
					"Translation": {
						"Text": "生成モードに入る"
					},
					"Key": "EnterSpawnBtn"
				},
				{
					"Source": {
						"Text": "追加一个默认立方体条目（也可从内容浏览器拖入具体网格）"
					},
					"Translation": {
						"Text": "既定の立方体エントリを追加（コンテンツブラウザから具体メッシュをドラッグ可）"
					},
					"Key": "AddMeshBtnTip"
				},
				{
					"Source": {
						"Text": "退出生成模式"
					},
					"Translation": {
						"Text": "生成モードを終了"
					},
					"Key": "ExitSpawnBtn"
				},
				{
					"Source": {
						"Text": "选择场景物体"
					},
					"Translation": {
						"Text": "シーンオブジェクトを選択"
					},
					"Key": "SelTitle"
				},
				{
					"Source": {
						"Text": "选择存档: "
					},
					"Translation": {
						"Text": "アーカイブを選択: "
					},
					"Key": "PoseLabel"
				},
				{
					"Source": {
						"Text": "随机偏移系数: "
					},
					"Translation": {
						"Text": "ランダムオフセット係数: "
					},
					"Key": "RandOffLabel"
				},
				{
					"Source": {
						"Text": "随机生成网格"
					},
					"Translation": {
						"Text": "ランダムメッシュ生成"
					},
					"Key": "RandomSpawnTxt"
				},
				{
					"Source": {
						"Text": "（给生成位置叠加 ±该值的随机抖动，单位厘米）"
					},
					"Translation": {
						"Text": "（生成位置に±この値のランダム揺らぎを加算、単位はセンチメートル）"
					},
					"Key": "RandOffUnit"
				}
			]
		},
		{
			"Namespace": "SAAU",
			"Children": [
				{
					"Source": {
						"Text": "批量处理动画修饰符"
					},
					"Translation": {
						"Text": "アニメーション修飾子を一括処理"
					},
					"Key": "BatchModTx"
				},
				{
					"Source": {
						"Text": "批量添加"
					},
					"Translation": {
						"Text": "一括追加"
					},
					"Key": "ApplyOnly"
				},
				{
					"Source": {
						"Text": "批量添加动画修饰符并应用"
					},
					"Translation": {
						"Text": "アニメーション修飾子を一括追加して適用"
					},
					"Key": "AddAnimationModify"
				},
				{
					"Source": {
						"Text": "批量添加并应用"
					},
					"Translation": {
						"Text": "一括追加して適用"
					},
					"Key": "ApplyFull"
				},
				{
					"Source": {
						"Text": "清空列表"
					},
					"Translation": {
						"Text": "リストをクリア"
					},
					"Key": "ClearStaged"
				},
				{
					"Source": {
						"Text": "相关操作请在资产（或场景Actor）右键菜单中脚本操作中查看"
					},
					"Translation": {
						"Text": "関連操作はアセット（またはシーンActor）の右クリックメニューのスクリプト操作で確認"
					},
					"Key": "Title"
				},
				{
					"Source": {
						"Text": "确认选择"
					},
					"Translation": {
						"Text": "選択を確定"
					},
					"Key": "AddBtn"
				},
				{
					"Source": {
						"Text": "选择: "
					},
					"Translation": {
						"Text": "選択: "
					},
					"Key": "SelectLabel"
				},
				{
					"Source": {
						"Text": "（已选列表）"
					},
					"Translation": {
						"Text": "（選択済みリスト）"
					},
					"Key": "StagedHeader"
				}
			]
		},
		{
			"Namespace": "SBlankTemplateTool",
			"Children": [
				{
					"Source": {
						"Text": "工具空白模版"
					},
					"Translation": {
						"Text": "ツール空テンプレート"
					},
					"Key": "工具空白模版"
				}
			]
		},
		{
			"Namespace": "SImport_MM",
			"Children": [
				{
					"Source": {
						"Text": "/Game/BatchImport/"
					},
					"Translation": {
						"Text": "/Game/BatchImport/"
					},
					"Key": "Hint"
				},
				{
					"Source": {
						"Text": "从已有父材质实例复制并设置贴图参数"
					},
					"Translation": {
						"Text": "既存の親マテリアルインスタンスからコピーし、テクスチャパラメータを設定"
					},
					"Key": "UseMITip"
				},
				{
					"Source": {
						"Text": "任务日志:"
					},
					"Translation": {
						"Text": "タスクログ:"
					},
					"Key": "LogLabel"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 选择要导入模型和贴图的文件夹\n  2. 点导入即可\n  还不清楚怎么用可前往作者B站查看使用教程\n"
					},
					"Translation": {
						"Text": "使い方:\n  1. インポートするモデルとテクスチャのフォルダを選択\n  2. 「インポート」をクリックで開始\n  使い方が不明な場合は作者のBilibiliでチュートリアルを参照\n"
					},
					"Key": "AutoPrefixHelp"
				},
				{
					"Source": {
						"Text": "使用父材质实例"
					},
					"Translation": {
						"Text": "親マテリアルインスタンスを使用"
					},
					"Key": "UseMI"
				},
				{
					"Source": {
						"Text": "保存位置: "
					},
					"Translation": {
						"Text": "保存場所: "
					},
					"Key": "Dst"
				},
				{
					"Source": {
						"Text": "创建实例并应用"
					},
					"Translation": {
						"Text": "インスタンスを作成して適用"
					},
					"Key": "CreateMI"
				},
				{
					"Source": {
						"Text": "前缀:"
					},
					"Translation": {
						"Text": "プレフィックス:"
					},
					"Key": "PrefixLabel"
				},
				{
					"Source": {
						"Text": "勾选时，合并模型拆分后的每个子模型会加上合并模型名作为前缀（如 SM_Chair_Seat）；取消勾选则只保留子模型原名（如 SM_Seat）"
					},
					"Translation": {
						"Text": "チェック時、結合モデル分割後の各サブモデルに結合モデル名をプレフィックスとして付加（例: SM_Chair_Seat）。未チェック時はサブモデル元名のみ保持（例: SM_Seat）"
					},
					"Key": "UseCombinedPrefixTip"
				},
				{
					"Source": {
						"Text": "后缀:"
					},
					"Translation": {
						"Text": "サフィックス:"
					},
					"Key": "SuffixLabel"
				},
				{
					"Source": {
						"Text": "在母材质基础上生成材质实例"
					},
					"Translation": {
						"Text": "親マテリアルをベースにマテリアルインスタンスを生成"
					},
					"Key": "CreateMITip"
				},
				{
					"Source": {
						"Text": "如果使用自己自定义的材质球，请根据对应通道填写参数名"
					},
					"Translation": {
						"Text": "独自のカスタムマテリアルを使う場合、対応チャンネルに応じてパラメータ名を入力"
					},
					"Key": "ToolTip"
				},
				{
					"Source": {
						"Text": "如果纹理贴图不与模型同一层级下，而是处于同级的文件夹内，请输入统一的此文件夹名称。留空则默认贴图与模型同级。 "
					},
					"Translation": {
						"Text": "テクスチャがモデルと同階層ではなく、同じ階層のフォルダ内にある場合、そのフォルダ名を入力してください。空白の場合はモデルと同じ階層になります。"
					},
					"Key": "Tip"
				},
				{
					"Source": {
						"Text": "导入"
					},
					"Translation": {
						"Text": "インポート"
					},
					"Key": "Run"
				},
				{
					"Source": {
						"Text": "批量导入工具"
					},
					"Translation": {
						"Text": "一括インポートツール"
					},
					"Key": "Title"
				},
				{
					"Source": {
						"Text": "拆分模型添加合并模型名前缀"
					},
					"Translation": {
						"Text": "モデル分割時に結合モデル名プレフィックスを追加"
					},
					"Key": "UseCombinedPrefix"
				},
				{
					"Source": {
						"Text": "浏览"
					},
					"Translation": {
						"Text": "参照"
					},
					"Key": "B1"
				},
				{
					"Source": {
						"Text": "清空日志"
					},
					"Translation": {
						"Text": "ログをクリア"
					},
					"Key": "Clear"
				},
				{
					"Source": {
						"Text": "源文件夹: "
					},
					"Translation": {
						"Text": "ソースフォルダ: "
					},
					"Key": "Src"
				},
				{
					"Source": {
						"Text": "生成通用父材质及实例"
					},
					"Translation": {
						"Text": "共通親マテリアルとインスタンスを生成"
					},
					"Key": "CreateGenMat"
				},
				{
					"Source": {
						"Text": "留空则在模型同级目录找贴图"
					},
					"Translation": {
						"Text": "空白の場合はモデルと同じディレクトリからテクスチャを探す"
					},
					"Key": "TexHint"
				},
				{
					"Source": {
						"Text": "自动创建一个带有标准参数(BaseColor, Normal, ORM)的父材质及其对应的实例"
					},
					"Translation": {
						"Text": "標準パラメータ(BaseColor, Normal, ORM)を持つ親マテリアルと対応インスタンスを自動生成"
					},
					"Key": "CreateGenMatTip"
				},
				{
					"Source": {
						"Text": "贴图参数名配置"
					},
					"Translation": {
						"Text": "テクスチャパラメータ名設定"
					},
					"Key": "ParamConfig"
				},
				{
					"Source": {
						"Text": "贴图子文件夹名: "
					},
					"Translation": {
						"Text": "テクスチャサブフォルダ名: "
					},
					"Key": "TexFolder"
				},
				{
					"Source": {
						"Text": "资产命名详细规则"
					},
					"Translation": {
						"Text": "アセット命名の詳細ルール"
					},
					"Key": "NamingRules"
				},
				{
					"Source": {
						"Text": "输入后缀内容..."
					},
					"Translation": {
						"Text": "サフィックス内容を入力..."
					},
					"Key": "SuffixHint"
				},
				{
					"Source": {
						"Text": "选择路径"
					},
					"Translation": {
						"Text": "パスを選択"
					},
					"Key": "B2"
				}
			]
		},
		{
			"Namespace": "SSpawnMaterial",
			"Children": [
				{
					"Source": {
						"Text": "/Game/Materials"
					},
					"Translation": {
						"Text": "/Game/Materials"
					},
					"Key": "DstHint"
				},
				{
					"Source": {
						"Text": "从已有父材质实例复制并设置贴图参数"
					},
					"Translation": {
						"Text": "既存の親マテリアルインスタンスからコピーし、テクスチャパラメータを設定"
					},
					"Key": "UseMITip"
				},
				{
					"Source": {
						"Text": "任务日志:"
					},
					"Translation": {
						"Text": "タスクログ:"
					},
					"Key": "LogLabel"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 在内容浏览器中选中一个或多个纹理贴图（除此之外也可以加选一个或多个模型）\n  2. 在下方设置保存路径与生成模式\n  3. 点击「生成材质」按钮（如果选择中包含模型，生成的材质会赋予给对应的模型，前提是模型命名规范）\n"
					},
					"Translation": {
						"Text": "使い方:\n  1. コンテンツブラウザでテクスチャを1つ以上選択（さらにモデルを1つ以上加選可）\n  2. 下で保存パスと生成モードを設定\n  3. 「マテリアル生成」ボタンをクリック（選択にモデルが含まれる場合、命名が正しければ生成マテリアルが対応モデルに割当）\n"
					},
					"Key": "Usage"
				},
				{
					"Source": {
						"Text": "使用父材质实例"
					},
					"Translation": {
						"Text": "親マテリアルインスタンスを使用"
					},
					"Key": "UseMI"
				},
				{
					"Source": {
						"Text": "保存位置: "
					},
					"Translation": {
						"Text": "保存場所: "
					},
					"Key": "Dst"
				},
				{
					"Source": {
						"Text": "保存到贴图同级目录"
					},
					"Translation": {
						"Text": "テクスチャと同じディレクトリに保存"
					},
					"Key": "SaveNextToTextures"
				},
				{
					"Source": {
						"Text": "创建实例并应用"
					},
					"Translation": {
						"Text": "インスタンスを作成して適用"
					},
					"Key": "CreateMI"
				},
				{
					"Source": {
						"Text": "前缀:"
					},
					"Translation": {
						"Text": "プレフィックス:"
					},
					"Key": "PrefixLabel"
				},
				{
					"Source": {
						"Text": "勾选后忽略上方保存位置，材质球保存到选中贴图所在目录"
					},
					"Translation": {
						"Text": "チェック時、上の保存場所を無視し、マテリアルを選択テクスチャのあるディレクトリに保存"
					},
					"Key": "SaveNextToTexturesTip"
				},
				{
					"Source": {
						"Text": "勾选后忽略上方保存位置，材质球保存到选中贴图所在目录"
					},
					"Translation": {
						"Text": "チェック時、上の保存場所を無視し、マテリアルを選択テクスチャのあるディレクトリに保存"
					},
					"Key": "SaveNextToTexturesTip2"
				},
				{
					"Source": {
						"Text": "后缀:"
					},
					"Translation": {
						"Text": "サフィックス:"
					},
					"Key": "SuffixLabel"
				},
				{
					"Source": {
						"Text": "在母材质基础上生成材质实例"
					},
					"Translation": {
						"Text": "親マテリアルをベースにマテリアルインスタンスを生成"
					},
					"Key": "CreateMITip"
				},
				{
					"Source": {
						"Text": "如果使用自己自定义的材质球，请根据对应通道填写参数名"
					},
					"Translation": {
						"Text": "独自のカスタムマテリアルを使う場合、対応チャンネルに応じてパラメータ名を入力"
					},
					"Key": "ParamConfigTip"
				},
				{
					"Source": {
						"Text": "批量材质球生成"
					},
					"Translation": {
						"Text": "一括マテリアル生成"
					},
					"Key": "Title"
				},
				{
					"Source": {
						"Text": "本工具将内容浏览器中选中的纹理贴图，根据文件名关键词自动识别贴图通道类型（基础色 / 法线 / ORM / 粗糙度 / 金属度 / 自发光 / 透明度等），并据此生成材质球。"
					},
					"Translation": {
						"Text": "本ツールはコンテンツブラウザで選択したテクスチャから、ファイル名キーワードでチャンネル種別（ベースカラー／法線／ORM／粗さ／金属度／自己発光／透過など）を自動判別し、それに基づきマテリアルを生成します。"
					},
					"Key": "Desc"
				},
				{
					"Source": {
						"Text": "清空日志"
					},
					"Translation": {
						"Text": "ログをクリア"
					},
					"Key": "Clear"
				},
				{
					"Source": {
						"Text": "生成材质"
					},
					"Translation": {
						"Text": "マテリアル生成"
					},
					"Key": "Generate"
				},
				{
					"Source": {
						"Text": "生成通用父材质及实例"
					},
					"Translation": {
						"Text": "共通親マテリアルとインスタンスを生成"
					},
					"Key": "CreateGenMat"
				},
				{
					"Source": {
						"Text": "自动创建一个带有标准参数(BaseColor, Normal, ORM, AO, Roughness, Metallic 等)\n和静态开关的父材质及其对应的实例，供「使用父材质实例」模式使用。"
					},
					"Translation": {
						"Text": "標準パラメータ(BaseColor, Normal, ORM, AO, Roughness, Metallic等)と静的スイッチを持つ親マテリアルと対応インスタンスを自動生成し、「親マテリアルインスタンスを使用」モードで利用。"
					},
					"Key": "CreateGenMatTip"
				},
				{
					"Source": {
						"Text": "贴图参数名配置"
					},
					"Translation": {
						"Text": "テクスチャパラメータ名設定"
					},
					"Key": "ParamConfig"
				},
				{
					"Source": {
						"Text": "资产命名详细规则"
					},
					"Translation": {
						"Text": "アセット命名の詳細ルール"
					},
					"Key": "NamingRules"
				},
				{
					"Source": {
						"Text": "输入后缀内容..."
					},
					"Translation": {
						"Text": "サフィックス内容を入力..."
					},
					"Key": "SuffixHint"
				},
				{
					"Source": {
						"Text": "选择路径"
					},
					"Translation": {
						"Text": "パスを選択"
					},
					"Key": "BrowseDst"
				}
			]
		},
		{
			"Namespace": "Tools",
			"Children": [
				{
					"Source": {
						"Text": "批量导入模型和材质，同文件下的模型以及附属的纹理贴图会自动连接材质球并赋予模型"
					},
					"Translation": {
						"Text": "モデルとマテリアルを一括インポート。同ファイル内のモデルと付属テクスチャは自動的にマテリアルと接続されモデルに割当"
					},
					"Key": "ToolDetail"
				}
			]
		},
		{
			"Namespace": "ToolsBox",
			"Children": [
				{
					"Source": {
						"Text": "工具名称"
					},
					"Translation": {
						"Text": "ツール名"
					},
					"Key": "SearchHint"
				},
				{
					"Source": {
						"Text": "打开作者页面"
					},
					"Translation": {
						"Text": "作者ページを開く"
					},
					"Key": "OpenAuthorURL"
				},
				{
					"Source": {
						"Text": "打开工具"
					},
					"Translation": {
						"Text": "ツールを開く"
					},
					"Key": "OpenBtn"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "OpenToolsBox_Command",
					"Children": [
						{
							"Source": {
								"Text": "ToolsBox"
							},
							"Translation": {
								"Text": "ツールボックス"
							},
							"Key": "ToolsBox_OpenToolsBox"
						},
						{
							"Source": {
								"Text": "点击打开功能窗口"
							},
							"Translation": {
								"Text": "機能ウィンドウを開く"
							},
							"Key": "ToolsBox_OpenToolsBox_ToolTip"
						}
					]
				}
			]
		},
		{
			"Namespace": "VariableCopier",
			"Children": [
				{
					"Source": {
						"Text": "{0} ({1})"
					},
					"Translation": {
						"Text": "{0} ({1})"
					},
					"Key": "CatFmt"
				},
				{
					"Source": {
						"Text": "{0} ({1})"
					},
					"Translation": {
						"Text": "{0} ({1})"
					},
					"Key": "CatFmtP"
				},
				{
					"Source": {
						"Text": "事件分发器"
					},
					"Translation": {
						"Text": "イベントディスパッチャ"
					},
					"Key": "NDisp"
				},
				{
					"Source": {
						"Text": "事件图表"
					},
					"Translation": {
						"Text": "イベントグラフ"
					},
					"Key": "NEnv"
				},
				{
					"Source": {
						"Text": "从待处理区里拿掉这一项"
					},
					"Translation": {
						"Text": "処理待ち領域からこの項目を削除"
					},
					"Key": "M_DelTip"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 两边选择要互相复制的蓝图类（拖动前按住shift为复制，alt为剪切）\n  2. 将要复制或剪切的变量，宏，函数等拖进对方待处理区域内\n  3. 点击 确定 即可生效\n"
					},
					"Translation": {
						"Text": "使い方:\n  1. 両側で相互コピーするブループリントクラスを選択（ドラッグ前にShiftでコピー、Altでカット）\n  2. コピー／カットしたい変数・マクロ・関数などを相手側の処理待ち領域へドラッグ\n  3. 「OK」をクリックで反映\n"
					},
					"Key": "AutoPrefixHelp"
				},
				{
					"Source": {
						"Text": "函数"
					},
					"Translation": {
						"Text": "関数"
					},
					"Key": "NFn"
				},
				{
					"Source": {
						"Text": "刷新"
					},
					"Translation": {
						"Text": "更新"
					},
					"Key": "RefreshBtn"
				},
				{
					"Source": {
						"Text": "剪切"
					},
					"Translation": {
						"Text": "カット"
					},
					"Key": "M_Cut"
				},
				{
					"Source": {
						"Text": "变量"
					},
					"Translation": {
						"Text": "変数"
					},
					"Key": "NVar"
				},
				{
					"Source": {
						"Text": "复制"
					},
					"Translation": {
						"Text": "コピー"
					},
					"Key": "M_Copy"
				},
				{
					"Source": {
						"Text": "宏"
					},
					"Translation": {
						"Text": "マクロ"
					},
					"Key": "NMacro"
				},
				{
					"Source": {
						"Text": "待处理（拖到这里的，点确定才生效）："
					},
					"Translation": {
						"Text": "処理待ち（ここにドラッグしたものはOKクリックで反映）:"
					},
					"Key": "PendingTitle"
				},
				{
					"Source": {
						"Text": "把两个面板待处理里的东西真正写进各自蓝图"
					},
					"Translation": {
						"Text": "両パネルの処理待ち項目を実際に各ブループリントに書き込む"
					},
					"Key": "ConfirmTip"
				},
				{
					"Source": {
						"Text": "清空两个面板的待处理区（不影响蓝图）"
					},
					"Translation": {
						"Text": "両パネルの処理待ち領域をクリア（ブループリントには影響しない）"
					},
					"Key": "ResetTip"
				},
				{
					"Source": {
						"Text": "确定"
					},
					"Translation": {
						"Text": "OK"
					},
					"Key": "ConfirmBtn"
				},
				{
					"Source": {
						"Text": "移除"
					},
					"Translation": {
						"Text": "削除"
					},
					"Key": "M_Del"
				},
				{
					"Source": {
						"Text": "这一项应用时会剪切（从源蓝图移除）"
					},
					"Translation": {
						"Text": "適用時にカットされます（ソースBPから削除）"
					},
					"Key": "M_CutTip"
				},
				{
					"Source": {
						"Text": "这一项应用时会复制（源蓝图保留）"
					},
					"Translation": {
						"Text": "適用時にコピーされます（ソースBPは保持）"
					},
					"Key": "M_CopyTip"
				},
				{
					"Source": {
						"Text": "重新扫描两个蓝图，检查内容是否变化"
					},
					"Translation": {
						"Text": "両ブループリントを再スキャンし変更を確認"
					},
					"Key": "RefreshTip"
				},
				{
					"Source": {
						"Text": "重置"
					},
					"Translation": {
						"Text": "リセット"
					},
					"Key": "ResetBtn"
				}
			]
		}
	]
}